Revit 2024 API
MEPSystemType.LinePatternId Property
 Indicates the line pattern id that should override the line pattern id for all components in the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ElementId LinePatternId { get; set; }
Visual Basic
Public Property LinePatternId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ LinePatternId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
MEPSystemType Class
Autodesk.Revit.DB Namespace